; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v4 ?v1)
             (pred_12 ?v8 ?v10)
             (pred_5 ?v4 ?v10)
             (pred_2 ?v6 ?v4 )
	     (pred_7 ?v4)
             (pred_11 ?v3)
             (pred_1 ?v8)
             (pred_3 ?v10)
             (pred_9 ?v4)
             (pred_4 ?v8)
             (pred_10 ?v4)
             (pred_8 ))



(:action op_3
:parameters (?v7 ?v11 ?v9 ?v12)
:precondition (and (pred_11 ?v7) (pred_11 ?v11) (pred_1 ?v9) (pred_3 ?v12)
          (pred_6 ?v7 ?v11) (pred_12 ?v9 ?v12)
                   (pred_5 ?v11 ?v12) (pred_7 ?v7) 
                   (pred_9 ?v11) (pred_4 ?v9))
:effect (and  (pred_10 ?v11) (not (pred_9 ?v11))))


(:action op_5
:parameters (?v7 ?v2)
:precondition (and (pred_11 ?v7) (pred_11 ?v2)
               (pred_7 ?v7) (pred_6 ?v7 ?v2) (pred_10 ?v2))
:effect (and (pred_7 ?v2) (not (pred_7 ?v7))))

(:action op_1
:parameters (?v7 ?v9)
:precondition (and (pred_11 ?v7) (pred_1 ?v9) 
                  (pred_7 ?v7) (pred_2 ?v9 ?v7) (pred_8 ))
:effect (and (pred_4 ?v9)
   (not (pred_2 ?v9 ?v7)) (not (pred_8 ))))


(:action op_4
:parameters (?v7 ?v13 ?v5)
:precondition (and (pred_11 ?v7) (pred_1 ?v13) (pred_1 ?v5)
                  (pred_7 ?v7) (pred_4 ?v5) (pred_2 ?v13 ?v7))
:effect (and (pred_4 ?v13) (pred_2 ?v5 ?v7)
        (not (pred_4 ?v5)) (not (pred_2 ?v13 ?v7))))

(:action op_2
:parameters (?v7 ?v9)
:precondition (and (pred_11 ?v7) (pred_1 ?v9) 
                  (pred_7 ?v7) (pred_4 ?v9))
:effect (and (pred_8 ) (pred_2 ?v9 ?v7) (not (pred_4 ?v9)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_19 obj_17 obj_10 obj_18 obj_02 obj_07 obj_14 obj_06 obj_15 obj_11 obj_04 obj_13 obj_09 obj_01 obj_03 obj_12
    obj_16 obj_08
    obj_20 obj_05
    )

    (:init
       (pred_8)

       (pred_11 obj_19)
       (pred_11 obj_17)
       (pred_11 obj_10)
       (pred_11 obj_18)
       (pred_11 obj_02)
       (pred_11 obj_07)
       (pred_11 obj_14)
       (pred_11 obj_06)
       (pred_11 obj_15)
       (pred_11 obj_11)
       (pred_11 obj_04)
       (pred_11 obj_13)
       (pred_11 obj_09)
       (pred_11 obj_01)
       (pred_11 obj_03)
       (pred_11 obj_12)
       (pred_3 obj_16)
       (pred_3 obj_08)
       (pred_1 obj_20)
       (pred_1 obj_05)

       (pred_6 obj_19 obj_02)
       (pred_6 obj_19 obj_17)
       (pred_6 obj_17 obj_07)
       (pred_6 obj_17 obj_10)
       (pred_6 obj_17 obj_19)
       (pred_6 obj_10 obj_14)
       (pred_6 obj_10 obj_18)
       (pred_6 obj_10 obj_17)
       (pred_6 obj_18 obj_06)
       (pred_6 obj_18 obj_10)
       (pred_6 obj_02 obj_15)
       (pred_6 obj_02 obj_07)
       (pred_6 obj_02 obj_19)
       (pred_6 obj_07 obj_11)
       (pred_6 obj_07 obj_14)
       (pred_6 obj_07 obj_17)
       (pred_6 obj_07 obj_02)
       (pred_6 obj_14 obj_04)
       (pred_6 obj_14 obj_06)
       (pred_6 obj_14 obj_10)
       (pred_6 obj_14 obj_07)
       (pred_6 obj_06 obj_13)
       (pred_6 obj_06 obj_18)
       (pred_6 obj_06 obj_14)
       (pred_6 obj_15 obj_09)
       (pred_6 obj_15 obj_11)
       (pred_6 obj_15 obj_02)
       (pred_6 obj_11 obj_01)
       (pred_6 obj_11 obj_04)
       (pred_6 obj_11 obj_07)
       (pred_6 obj_11 obj_15)
       (pred_6 obj_04 obj_03)
       (pred_6 obj_04 obj_13)
       (pred_6 obj_04 obj_14)
       (pred_6 obj_04 obj_11)
       (pred_6 obj_13 obj_12)
       (pred_6 obj_13 obj_06)
       (pred_6 obj_13 obj_04)
       (pred_6 obj_09 obj_01)
       (pred_6 obj_09 obj_15)
       (pred_6 obj_01 obj_03)
       (pred_6 obj_01 obj_11)
       (pred_6 obj_01 obj_09)
       (pred_6 obj_03 obj_12)
       (pred_6 obj_03 obj_04)
       (pred_6 obj_03 obj_01)
       (pred_6 obj_12 obj_13)
       (pred_6 obj_12 obj_03)
       (pred_9 obj_12)
       (pred_9 obj_09)
       (pred_5  obj_12 obj_16)
       (pred_5  obj_09 obj_08)
       (pred_10 obj_19)
       (pred_10 obj_17)
       (pred_10 obj_10)
       (pred_10 obj_18)
       (pred_10 obj_02)
       (pred_10 obj_07)
       (pred_10 obj_14)
       (pred_10 obj_06)
       (pred_10 obj_15)
       (pred_10 obj_11)
       (pred_10 obj_04)
       (pred_10 obj_13)
       (pred_10 obj_01)
       (pred_10 obj_03)

       (pred_12  obj_20 obj_16)
       (pred_12  obj_05 obj_08)
       (pred_2 obj_20 obj_04)
       (pred_2 obj_05 obj_02)
       (pred_7 obj_06)
    )

    (:goal (and
       (pred_2 obj_05 obj_10)
    ))
(:constraints
  (always (not (pred_7 obj_14)))
)
)

; plan
1. (op_5 obj_06 obj_18)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_18)
   goals met: 0 of 1
2. (op_5 obj_18 obj_10)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_10)
   goals met: 0 of 1
3. (op_5 obj_10 obj_17)
   deleted: (pred_7 obj_10)
   added: (pred_7 obj_17)
   goals met: 0 of 1
4. (op_5 obj_17 obj_19)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_19)
   goals met: 0 of 1
5. (op_5 obj_19 obj_02)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_02)
   goals met: 0 of 1
6. (op_1 obj_02 obj_05)
   deleted: (pred_2 obj_05 obj_02) (pred_8)
   added: (pred_4 obj_05)
   goals met: 0 of 1
7. (op_5 obj_02 obj_19)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_19)
   goals met: 0 of 1
8. (op_5 obj_19 obj_17)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_17)
   goals met: 0 of 1
9. (op_5 obj_17 obj_10)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_10)
   goals met: 0 of 1
10. (op_2 obj_10 obj_05)
   deleted: (pred_4 obj_05)
   added: (pred_8) (pred_2 obj_05 obj_10)
   goals met: 1 of 1
